src/cf/Catalogs/CRM_УчетныеЗаписиМессенджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_УчетныеЗаписиМессенджеров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипМессенджера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CRM_ТипыМессенджеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторЗадания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПросмотрСообщенийВсемПользователям</Name>
					<Comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачальнойЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ИсточникЛидов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_УказыватьПричинуОтклонения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/CRM_ТипыМессенджеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ТипыМессенджеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВКонтакте</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/CRM_УчетныеЗаписиМессенджеров/Forms/ФормаАвторизации/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ТипМессенджера", ТипМессенджера);
	Если Параметры.Свойство("АвторизацияПользователя", АвторизацияПользователя) Тогда
		Если ТипМессенджера = Перечисления.CRM_ТипыМессенджеров.ВКонтакте Тогда
			ПутьКСтраницеАвторизации = "https://oauth.vk.com/authorize?v=5.67&client_id=6086563&scope=groups,offline,docs&redirect_uri=http://api.vk.com/blank.html&display=page&response_type=token";
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ПолучениеТокенаГруппы", ПолучениеТокенаГруппы) Тогда
		Параметры.Свойство("IDГруппы", IDГруппы);
		Если ТипМессенджера = Перечисления.CRM_ТипыМессенджеров.ВКонтакте Тогда
			ПутьКСтраницеАвторизации = "https://oauth.vk.com/authorize?v=5.67&client_id=6086563&group_ids="+IDГруппы+"&scope=messages,manage,docs&redirect_uri=http://api.vk.com/blank.html&display=page&response_type=token";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ТекстЗапроса.Видимость = Истина;
	Элементы.ТекстЗапроса.Документ.URL = ПутьКСтраницеАвторизации;
	ПодключитьОбработчикОжидания("ТекстЗапросаДокументСформирован", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТекстЗапросаДокументСформирован()
	Ресурс = Элементы.ТекстЗапроса.Документ.URL;
	Если ТипМессенджера = ПредопределенноеЗначение("Перечисление.CRM_ТипыМессенджеров.ВКонтакте") Тогда
		СтрокаНачалаТокена = ?(АвторизацияПользователя, "access_token=", "access_token_"+IDГруппы+"=");
		Позиция = СтрНайти(Ресурс, СтрокаНачалаТокена);
		Если Позиция>0 Тогда
			Элементы.ТекстЗапроса.Видимость = Ложь;
			МаркерДоступа = Сред(Ресурс, Позиция+СтрДлина(СтрокаНачалаТокена),  СтрНайти(Ресурс, "&expires_in=")-(Позиция+13));
			Закрыть(Новый Структура("Токен", МаркерДоступа));
		КонецЕсли;
	КонецЕсли;
	ПодключитьОбработчикОжидания("ТекстЗапросаДокументСформирован", 0.1, Истина);
КонецПроцедуры
